Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/phy_apps/phy_plc_and_go/firmware/src/packs/PIC32CX2051MTG128_DFP/component/cpkcc.h
/*
 * Component description for CPKCC
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-12-19T08:59:22Z */
#ifndef _PIC32CXMTG_CPKCC_COMPONENT_H_
#define _PIC32CXMTG_CPKCC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR CPKCC                                        */
/* ************************************************************************** */

/* -------- CPKCC_R : (CPKCC Offset: 0x00) (R/W 32) R Parameter Register -------- */
#define CPKCC_R_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_R) CPKCC_R value Position */
#define CPKCC_R_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_R_VALUE_Pos)          /* (CPKCC_R) CPKCC_R value Mask */
#define CPKCC_R_VALUE(value)                  (CPKCC_R_VALUE_Msk & (_UINT32_(value) << CPKCC_R_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_R register */
#define CPKCC_R_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_R) Register Mask  */


/* -------- CPKCC_X : (CPKCC Offset: 0x04) (R/W 32) X Parameter Register -------- */
#define CPKCC_X_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_X) CPKCC_X value Position */
#define CPKCC_X_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_X_VALUE_Pos)          /* (CPKCC_X) CPKCC_X value Mask */
#define CPKCC_X_VALUE(value)                  (CPKCC_X_VALUE_Msk & (_UINT32_(value) << CPKCC_X_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_X register */
#define CPKCC_X_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_X) Register Mask  */


/* -------- CPKCC_Y : (CPKCC Offset: 0x08) (R/W 32) Y Parameter Register -------- */
#define CPKCC_Y_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_Y) CPKCC_Y value Position */
#define CPKCC_Y_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_Y_VALUE_Pos)          /* (CPKCC_Y) CPKCC_Y value Mask */
#define CPKCC_Y_VALUE(value)                  (CPKCC_Y_VALUE_Msk & (_UINT32_(value) << CPKCC_Y_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_Y register */
#define CPKCC_Y_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_Y) Register Mask  */


/* -------- CPKCC_Z : (CPKCC Offset: 0x0C) (R/W 32) Z Parameter Register -------- */
#define CPKCC_Z_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_Z) CPKCC_Z value Position */
#define CPKCC_Z_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_Z_VALUE_Pos)          /* (CPKCC_Z) CPKCC_Z value Mask */
#define CPKCC_Z_VALUE(value)                  (CPKCC_Z_VALUE_Msk & (_UINT32_(value) << CPKCC_Z_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_Z register */
#define CPKCC_Z_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_Z) Register Mask  */


/* -------- CPKCC_J : (CPKCC Offset: 0x10) (R/W 32) J Parameter Register -------- */
#define CPKCC_J_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_J) CPKCC_J value Position */
#define CPKCC_J_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_J_VALUE_Pos)          /* (CPKCC_J) CPKCC_J value Mask */
#define CPKCC_J_VALUE(value)                  (CPKCC_J_VALUE_Msk & (_UINT32_(value) << CPKCC_J_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_J register */
#define CPKCC_J_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_J) Register Mask  */


/* -------- CPKCC_K : (CPKCC Offset: 0x14) (R/W 32) K Parameter Register -------- */
#define CPKCC_K_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_K) CPKCC_K value Position */
#define CPKCC_K_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_K_VALUE_Pos)          /* (CPKCC_K) CPKCC_K value Mask */
#define CPKCC_K_VALUE(value)                  (CPKCC_K_VALUE_Msk & (_UINT32_(value) << CPKCC_K_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_K register */
#define CPKCC_K_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_K) Register Mask  */


/* -------- CPKCC_N : (CPKCC Offset: 0x18) (R/W 32) N Parameter Register -------- */
#define CPKCC_N_VALUE_Pos                     _UINT32_(0)                                          /* (CPKCC_N) CPKCC_N value Position */
#define CPKCC_N_VALUE_Msk                     (_UINT32_(0xFFFFFFFF) << CPKCC_N_VALUE_Pos)          /* (CPKCC_N) CPKCC_N value Mask */
#define CPKCC_N_VALUE(value)                  (CPKCC_N_VALUE_Msk & (_UINT32_(value) << CPKCC_N_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_N register */
#define CPKCC_N_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_N) Register Mask  */


/* -------- CPKCC_SMULA : (CPKCC Offset: 0x1C) (R/W 32) SMULA Register -------- */
#define CPKCC_SMULA_VALUE_Pos                 _UINT32_(0)                                          /* (CPKCC_SMULA) CPKCC_SMULA value Position */
#define CPKCC_SMULA_VALUE_Msk                 (_UINT32_(0xFFFFFFFF) << CPKCC_SMULA_VALUE_Pos)      /* (CPKCC_SMULA) CPKCC_SMULA value Mask */
#define CPKCC_SMULA_VALUE(value)              (CPKCC_SMULA_VALUE_Msk & (_UINT32_(value) << CPKCC_SMULA_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_SMULA register */
#define CPKCC_SMULA_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_SMULA) Register Mask  */


/* -------- CPKCC_SMULB : (CPKCC Offset: 0x20) (R/W 32) SMULB Register -------- */
#define CPKCC_SMULB_VALUE_Pos                 _UINT32_(0)                                          /* (CPKCC_SMULB) CPKCC_SMULB value Position */
#define CPKCC_SMULB_VALUE_Msk                 (_UINT32_(0xFFFFFFFF) << CPKCC_SMULB_VALUE_Pos)      /* (CPKCC_SMULB) CPKCC_SMULB value Mask */
#define CPKCC_SMULB_VALUE(value)              (CPKCC_SMULB_VALUE_Msk & (_UINT32_(value) << CPKCC_SMULB_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_SMULB register */
#define CPKCC_SMULB_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_SMULB) Register Mask  */


/* -------- CPKCC_SMULRL : (CPKCC Offset: 0x24) (R/W 32) SMULRL Register -------- */
#define CPKCC_SMULRL_VALUE_Pos                _UINT32_(0)                                          /* (CPKCC_SMULRL) CPKCC_SMULRL value Position */
#define CPKCC_SMULRL_VALUE_Msk                (_UINT32_(0xFFFFFFFF) << CPKCC_SMULRL_VALUE_Pos)     /* (CPKCC_SMULRL) CPKCC_SMULRL value Mask */
#define CPKCC_SMULRL_VALUE(value)             (CPKCC_SMULRL_VALUE_Msk & (_UINT32_(value) << CPKCC_SMULRL_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_SMULRL register */
#define CPKCC_SMULRL_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_SMULRL) Register Mask  */


/* -------- CPKCC_SMULRH : (CPKCC Offset: 0x28) (R/W 32) SMULRH Register -------- */
#define CPKCC_SMULRH_VALUE_Pos                _UINT32_(0)                                          /* (CPKCC_SMULRH) CPKCC_SMULRH value Position */
#define CPKCC_SMULRH_VALUE_Msk                (_UINT32_(0xFFFFFFFF) << CPKCC_SMULRH_VALUE_Pos)     /* (CPKCC_SMULRH) CPKCC_SMULRH value Mask */
#define CPKCC_SMULRH_VALUE(value)             (CPKCC_SMULRH_VALUE_Msk & (_UINT32_(value) << CPKCC_SMULRH_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_SMULRH register */
#define CPKCC_SMULRH_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_SMULRH) Register Mask  */


